; domain
(define (domain lec-winter-split-macros)
    (:requirements :strips :typing :equality :negative-preconditions)
    (:types match team referee server slot - object)
    (:constants home away - slot)

    (:predicates
        (connected ?m1 - match ?m2 - match ?s - slot)
        (participant ?t - team ?m - match ?s - slot)
        (ref-available ?r - referee)
        (server-available ?s - server)
        
        ;; Predicados de estado necesarios para el grafo
        (verified ?m - match) 
        (winner-determined ?m - match)
        (winner ?m - match ?t - team)
        
        ;; Flag de control
        (has-conflict ?m - match)
    )

    ;; MACRO 1: Partido Normal Completo
    ;; Secuencia: Draft -> PlayClean -> Sign -> Verify
    (:action macro-complete-match-clean
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home) ;; Asumimos gana home
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (not (has-conflict ?m))  ;; Solo si NO hay conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
            ;; Los recursos entran y salen, el estado neto es neutral
        )
    )

    ;; MACRO 2: Partido con Incidencia Resuelta (Ruling)
    ;; Secuencia: Draft -> PlayBug -> Protest -> RulingConfirm -> Sign -> Verify
    (:action macro-complete-match-with-ruling
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (has-conflict ?m)        ;; Solo si HAY conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
        )
    )

    ;; MACRO 3: Partido con Replay (Costoso)
    ;; Secuencia: Draft -> PlayBug -> Protest -> Replay -> PlayClean -> Sign -> Verify
    ;; Nota: Esta macro asume que tras el replay se juega limpio.
    (:action macro-complete-match-with-replay
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (has-conflict ?m)        ;; Se dispara por conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
            ;; En un modelo con costes, aquí pondrías (increase (total-cost) 50)
        )
    )

    ;; MACRO 4: No Show (Administrativo)
    (:action macro-admin-noshow
        :parameters (?m - match ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            ;; No requiere recursos
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
        )
    )

    ;; Acción de Avanzar (Igual que en el normal)
    (:action promote-to-next-round
        :parameters (?m_src - match ?m_dst - match ?t - team ?s - slot)
        :precondition (and 
            (winner-determined ?m_src)
            (winner ?m_src ?t)
            (connected ?m_src ?m_dst ?s)
        )
        :effect (and 
            (participant ?t ?m_dst ?s)
        )
    )
)

; problem
(define (problem lec-16-R4-S4-P40)
    (:domain lec-winter-split-macros)
    (:objects
        team-1 team-2 team-3 team-4 team-5 team-6 team-7 team-8 team-9 team-10 team-11 team-12 team-13 team-14 team-15 team-16 - team
        m1 m2 m3 m4 m5 m6 m7 m8 m9 m10 m11 m12 m13 m14 m15 - match
        ref-1 ref-2 ref-3 ref-4 - referee
        server-1 server-2 server-3 server-4 - server
    )
    (:init
        (ref-available ref-1)
        (ref-available ref-2)
        (ref-available ref-3)
        (ref-available ref-4)
        (server-available server-1)
        (server-available server-2)
        (server-available server-3)
        (server-available server-4)
        (participant team-1 m1 home)
        (participant team-2 m1 away)
        (participant team-3 m2 home)
        (participant team-4 m2 away)
        (participant team-5 m3 home)
        (participant team-6 m3 away)
        (participant team-7 m4 home)
        (participant team-8 m4 away)
        (participant team-9 m5 home)
        (participant team-10 m5 away)
        (participant team-11 m6 home)
        (participant team-12 m6 away)
        (participant team-13 m7 home)
        (participant team-14 m7 away)
        (participant team-15 m8 home)
        (participant team-16 m8 away)
        (connected m1 m9 home)
        (connected m2 m9 away)
        (connected m3 m10 home)
        (connected m4 m10 away)
        (connected m5 m11 home)
        (connected m6 m11 away)
        (connected m7 m12 home)
        (connected m8 m12 away)
        (connected m9 m13 home)
        (connected m10 m13 away)
        (connected m11 m14 home)
        (connected m12 m14 away)
        (connected m13 m15 home)
        (connected m14 m15 away)
        (has-conflict m3)
        (has-conflict m8)
        (has-conflict m14)
        (has-conflict m15)
    )
    (:goal
        (verified m15)
    )
)

; plan
1. (macro-admin-noshow m1 team-1)
   added: (verified m1) (winner-determined m1) (winner m1 team-1)
   goals met: 0 of 1
2. (promote-to-next-round m1 m9 team-1 home)
   added: (participant team-1 m9 home)
   goals met: 0 of 1
3. (macro-admin-noshow m9 team-1)
   added: (verified m9) (winner-determined m9) (winner m9 team-1)
   goals met: 0 of 1
4. (promote-to-next-round m9 m13 team-1 home)
   added: (participant team-1 m13 home)
   goals met: 0 of 1
5. (macro-admin-noshow m13 team-1)
   added: (verified m13) (winner-determined m13) (winner m13 team-1)
   goals met: 0 of 1
6. (promote-to-next-round m13 m15 team-1 home)
   added: (participant team-1 m15 home)
   goals met: 0 of 1
7. (macro-admin-noshow m15 team-1)
   added: (verified m15) (winner-determined m15) (winner m15 team-1)
   goals met: 1 of 1
